MikroElektronika/core_packages/PIC/XC8/def/PIC18F1330/mcu.h
extern volatile PORTBbits_t PORTBbits __at(0xF81);
// bitfield macros
#define _PORTB_RB0_POSN                                     0x0
#define _PORTB_RB0_POSITION                                 0x0
#define _PORTB_RB0_SIZE                                     0x1
#define _PORTB_RB0_LENGTH                                   0x1
#define _PORTB_RB0_MASK                                     0x1
#define _PORTB_RB1_POSN                                     0x1
#define _PORTB_RB1_POSITION                                 0x1
#define _PORTB_RB1_SIZE                                     0x1
#define _PORTB_RB1_LENGTH                                   0x1
#define _PORTB_RB1_MASK                                     0x2
#define _PORTB_RB2_POSN                                     0x2
#define _PORTB_RB2_POSITION                                 0x2
#define _PORTB_RB2_SIZE                                     0x1
#define _PORTB_RB2_LENGTH                                   0x1
#define _PORTB_RB2_MASK                                     0x4
#define _PORTB_RB3_POSN                                     0x3
#define _PORTB_RB3_POSITION                                 0x3
#define _PORTB_RB3_SIZE                                     0x1
#define _PORTB_RB3_LENGTH                                   0x1
#define _PORTB_RB3_MASK                                     0x8
#define _PORTB_RB4_POSN                                     0x4
#define _PORTB_RB4_POSITION                                 0x4
#define _PORTB_RB4_SIZE                                     0x1
#define _PORTB_RB4_LENGTH                                   0x1
#define _PORTB_RB4_MASK                                     0x10
#define _PORTB_RB5_POSN                                     0x5
#define _PORTB_RB5_POSITION                                 0x5
#define _PORTB_RB5_SIZE                                     0x1
#define _PORTB_RB5_LENGTH                                   0x1
#define _PORTB_RB5_MASK                                     0x20
#define _PORTB_RB6_POSN                                     0x6
#define _PORTB_RB6_POSITION                                 0x6
#define _PORTB_RB6_SIZE                                     0x1
#define _PORTB_RB6_LENGTH                                   0x1
#define _PORTB_RB6_MASK                                     0x40
#define _PORTB_RB7_POSN                                     0x7
#define _PORTB_RB7_POSITION                                 0x7
#define _PORTB_RB7_SIZE                                     0x1
#define _PORTB_RB7_LENGTH                                   0x1
#define _PORTB_RB7_MASK                                     0x80
#define _PORTB_PWM0_POSN                                    0x0
#define _PORTB_PWM0_POSITION                                0x0
#define _PORTB_PWM0_SIZE                                    0x1
#define _PORTB_PWM0_LENGTH                                  0x1
#define _PORTB_PWM0_MASK                                    0x1
#define _PORTB_PWM1_POSN                                    0x1
#define _PORTB_PWM1_POSITION                                0x1
#define _PORTB_PWM1_SIZE                                    0x1
#define _PORTB_PWM1_LENGTH                                  0x1
#define _PORTB_PWM1_MASK                                    0x2
#define _PORTB_INT2_POSN                                    0x2
#define _PORTB_INT2_POSITION                                0x2
#define _PORTB_INT2_SIZE                                    0x1
#define _PORTB_INT2_LENGTH                                  0x1
#define _PORTB_INT2_MASK                                    0x4
#define _PORTB_INT3_POSN                                    0x3
#define _PORTB_INT3_POSITION                                0x3
#define _PORTB_INT3_SIZE                                    0x1
#define _PORTB_INT3_LENGTH                                  0x1
#define _PORTB_INT3_MASK                                    0x8
#define _PORTB_PWM2_POSN                                    0x4
#define _PORTB_PWM2_POSITION                                0x4
#define _PORTB_PWM2_SIZE                                    0x1
#define _PORTB_PWM2_LENGTH                                  0x1
#define _PORTB_PWM2_MASK                                    0x10
#define _PORTB_PWM3_POSN                                    0x5
#define _PORTB_PWM3_POSITION                                0x5
#define _PORTB_PWM3_SIZE                                    0x1
#define _PORTB_PWM3_LENGTH                                  0x1
#define _PORTB_PWM3_MASK                                    0x20
#define _PORTB_PWM4_POSN                                    0x6
#define _PORTB_PWM4_POSITION                                0x6
#define _PORTB_PWM4_SIZE                                    0x1
#define _PORTB_PWM4_LENGTH                                  0x1
#define _PORTB_PWM4_MASK                                    0x40
#define _PORTB_PWM5_POSN                                    0x7
#define _PORTB_PWM5_POSITION                                0x7
#define _PORTB_PWM5_SIZE                                    0x1
#define _PORTB_PWM5_LENGTH                                  0x1
#define _PORTB_PWM5_MASK                                    0x80
#define _PORTB_KBI2_POSN                                    0x2
#define _PORTB_KBI2_POSITION                                0x2
#define _PORTB_KBI2_SIZE                                    0x1
#define _PORTB_KBI2_LENGTH                                  0x1
#define _PORTB_KBI2_MASK                                    0x4
#define _PORTB_KBI3_POSN                                    0x3
#define _PORTB_KBI3_POSITION                                0x3
#define _PORTB_KBI3_SIZE                                    0x1
#define _PORTB_KBI3_LENGTH                                  0x1
#define _PORTB_KBI3_MASK                                    0x8
#define _PORTB_PGC_POSN                                     0x6
#define _PORTB_PGC_POSITION                                 0x6
#define _PORTB_PGC_SIZE                                     0x1
#define _PORTB_PGC_LENGTH                                   0x1
#define _PORTB_PGC_MASK                                     0x40
#define _PORTB_PGD_POSN                                     0x7
#define _PORTB_PGD_POSITION                                 0x7
#define _PORTB_PGD_SIZE                                     0x1
#define _PORTB_PGD_LENGTH                                   0x1
#define _PORTB_PGD_MASK                                     0x80
#define _PORTB_CMP2_POSN                                    0x2
#define _PORTB_CMP2_POSITION                                0x2
#define _PORTB_CMP2_SIZE                                    0x1
#define _PORTB_CMP2_LENGTH                                  0x1
#define _PORTB_CMP2_MASK                                    0x4
#define _PORTB_CMP1_POSN                                    0x3
#define _PORTB_CMP1_POSITION                                0x3
#define _PORTB_CMP1_SIZE                                    0x1
#define _PORTB_CMP1_LENGTH                                  0x1
#define _PORTB_CMP1_MASK                                    0x8
#define _PORTB_T1OSO_POSN                                   0x2
#define _PORTB_T1OSO_POSITION                               0x2
#define _PORTB_T1OSO_SIZE                                   0x1
#define _PORTB_T1OSO_LENGTH                                 0x1
#define _PORTB_T1OSO_MASK                                   0x4
#define _PORTB_T1OSI_POSN                                   0x3
#define _PORTB_T1OSI_POSITION                               0x3
#define _PORTB_T1OSI_SIZE                                   0x1
#define _PORTB_T1OSI_LENGTH                                 0x1
#define _PORTB_T1OSI_MASK                                   0x8
#define _PORTB_T1CKI_POSN                                   0x2
#define _PORTB_T1CKI_POSITION                               0x2
#define _PORTB_T1CKI_SIZE                                   0x1
#define _PORTB_T1CKI_LENGTH                                 0x1
#define _PORTB_T1CKI_MASK                                   0x4
#define _PORTB_CCP2_PA2_POSN                                0x3
#define _PORTB_CCP2_PA2_POSITION                            0x3
#define _PORTB_CCP2_PA2_SIZE                                0x1
#define _PORTB_CCP2_PA2_LENGTH                              0x1
#define _PORTB_CCP2_PA2_MASK                                0x8

// Register: OVDCONS
#define OVDCONS OVDCONS
extern volatile unsigned char           OVDCONS             __at(0xF82);
#ifndef _LIB_BUILD
asm("OVDCONS equ 0F82h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned POUT                   :6;
    };
    struct {
        unsigned POUT0                  :1;
        unsigned POUT1                  :1;
        unsigned POUT2                  :1;
        unsigned POUT3                  :1;
        unsigned POUT4                  :1;
        unsigned POUT5                  :1;
    };
} OVDCONSbits_t;
extern volatile OVDCONSbits_t OVDCONSbits __at(0xF82);
// bitfield macros
#define _OVDCONS_POUT_POSN                                  0x0
#define _OVDCONS_POUT_POSITION                              0x0
#define _OVDCONS_POUT_SIZE                                  0x6
#define _OVDCONS_POUT_LENGTH                                0x6
#define _OVDCONS_POUT_MASK                                  0x3F
#define _OVDCONS_POUT0_POSN                                 0x0
#define _OVDCONS_POUT0_POSITION                             0x0
#define _OVDCONS_POUT0_SIZE                                 0x1
#define _OVDCONS_POUT0_LENGTH                               0x1
#define _OVDCONS_POUT0_MASK                                 0x1
#define _OVDCONS_POUT1_POSN                                 0x1
#define _OVDCONS_POUT1_POSITION                             0x1
#define _OVDCONS_POUT1_SIZE                                 0x1
#define _OVDCONS_POUT1_LENGTH                               0x1
#define _OVDCONS_POUT1_MASK                                 0x2
#define _OVDCONS_POUT2_POSN                                 0x2
#define _OVDCONS_POUT2_POSITION                             0x2
#define _OVDCONS_POUT2_SIZE                                 0x1
#define _OVDCONS_POUT2_LENGTH                               0x1
#define _OVDCONS_POUT2_MASK                                 0x4
#define _OVDCONS_POUT3_POSN                                 0x3
#define _OVDCONS_POUT3_POSITION                             0x3
#define _OVDCONS_POUT3_SIZE                                 0x1
#define _OVDCONS_POUT3_LENGTH                               0x1
#define _OVDCONS_POUT3_MASK                                 0x8
#define _OVDCONS_POUT4_POSN                                 0x4
#define _OVDCONS_POUT4_POSITION                             0x4
#define _OVDCONS_POUT4_SIZE                                 0x1
#define _OVDCONS_POUT4_LENGTH                               0x1
#define _OVDCONS_POUT4_MASK                                 0x10
#define _OVDCONS_POUT5_POSN                                 0x5
#define _OVDCONS_POUT5_POSITION                             0x5
#define _OVDCONS_POUT5_SIZE                                 0x1
#define _OVDCONS_POUT5_LENGTH                               0x1
#define _OVDCONS_POUT5_MASK                                 0x20

// Register: OVDCOND
#define OVDCOND OVDCOND
extern volatile unsigned char           OVDCOND             __at(0xF83);
#ifndef _LIB_BUILD
asm("OVDCOND equ 0F83h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned POVD                   :6;
    };
    struct {
        unsigned POVD0                  :1;
        unsigned POVD1                  :1;
        unsigned POVD2                  :1;
        unsigned POVD3                  :1;
        unsigned POVD4                  :1;
        unsigned POVD5                  :1;
    };
} OVDCONDbits_t;
extern volatile OVDCONDbits_t OVDCONDbits __at(0xF83);
// bitfield macros
#define _OVDCOND_POVD_POSN                                  0x0
#define _OVDCOND_POVD_POSITION                              0x0
#define _OVDCOND_POVD_SIZE                                  0x6
#define _OVDCOND_POVD_LENGTH                                0x6
#define _OVDCOND_POVD_MASK                                  0x3F
#define _OVDCOND_POVD0_POSN                                 0x0
#define _OVDCOND_POVD0_POSITION                             0x0
#define _OVDCOND_POVD0_SIZE                                 0x1
#define _OVDCOND_POVD0_LENGTH                               0x1
#define _OVDCOND_POVD0_MASK                                 0x1
#define _OVDCOND_POVD1_POSN                                 0x1
#define _OVDCOND_POVD1_POSITION                             0x1
#define _OVDCOND_POVD1_SIZE                                 0x1
#define _OVDCOND_POVD1_LENGTH                               0x1
#define _OVDCOND_POVD1_MASK                                 0x2
#define _OVDCOND_POVD2_POSN                                 0x2
#define _OVDCOND_POVD2_POSITION                             0x2
#define _OVDCOND_POVD2_SIZE                                 0x1
#define _OVDCOND_POVD2_LENGTH                               0x1
#define _OVDCOND_POVD2_MASK                                 0x4
#define _OVDCOND_POVD3_POSN                                 0x3
#define _OVDCOND_POVD3_POSITION                             0x3
#define _OVDCOND_POVD3_SIZE                                 0x1
#define _OVDCOND_POVD3_LENGTH                               0x1
#define _OVDCOND_POVD3_MASK                                 0x8
#define _OVDCOND_POVD4_POSN                                 0x4
#define _OVDCOND_POVD4_POSITION                             0x4
#define _OVDCOND_POVD4_SIZE                                 0x1
#define _OVDCOND_POVD4_LENGTH                               0x1
#define _OVDCOND_POVD4_MASK                                 0x10
#define _OVDCOND_POVD5_POSN                                 0x5
#define _OVDCOND_POVD5_POSITION                             0x5
#define _OVDCOND_POVD5_SIZE                                 0x1
#define _OVDCOND_POVD5_LENGTH                               0x1
#define _OVDCOND_POVD5_MASK                                 0x20

// Register: DTCON
#define DTCON DTCON
extern volatile unsigned char           DTCON               __at(0xF84);
#ifndef _LIB_BUILD
asm("DTCON equ 0F84h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DTA                    :6;
        unsigned DTAPS                  :2;
    };
    struct {
        unsigned DT0                    :1;
        unsigned DT1                    :1;
        unsigned DT2                    :1;
        unsigned DT3                    :1;
        unsigned DT4                    :1;
        unsigned DT5                    :1;
        unsigned DTPS0                  :1;
        unsigned DTPS1                  :1;
    };
} DTCONbits_t;
extern volatile DTCONbits_t DTCONbits __at(0xF84);
// bitfield macros
#define _DTCON_DTA_POSN                                     0x0
#define _DTCON_DTA_POSITION                                 0x0
#define _DTCON_DTA_SIZE                                     0x6
#define _DTCON_DTA_LENGTH                                   0x6
#define _DTCON_DTA_MASK                                     0x3F
#define _DTCON_DTAPS_POSN                                   0x6
#define _DTCON_DTAPS_POSITION                               0x6
#define _DTCON_DTAPS_SIZE                                   0x2
#define _DTCON_DTAPS_LENGTH                                 0x2
#define _DTCON_DTAPS_MASK                                   0xC0
#define _DTCON_DT0_POSN                                     0x0
#define _DTCON_DT0_POSITION                                 0x0
#define _DTCON_DT0_SIZE                                     0x1
#define _DTCON_DT0_LENGTH                                   0x1
#define _DTCON_DT0_MASK                                     0x1
#define _DTCON_DT1_POSN                                     0x1
#define _DTCON_DT1_POSITION                                 0x1
#define _DTCON_DT1_SIZE                                     0x1
#define _DTCON_DT1_LENGTH                                   0x1
#define _DTCON_DT1_MASK                                     0x2
#define _DTCON_DT2_POSN                                     0x2
#define _DTCON_DT2_POSITION                                 0x2
#define _DTCON_DT2_SIZE                                     0x1
#define _DTCON_DT2_LENGTH                                   0x1
#define _DTCON_DT2_MASK                                     0x4
#define _DTCON_DT3_POSN                                     0x3
#define _DTCON_DT3_POSITION                                 0x3
#define _DTCON_DT3_SIZE                                     0x1
#define _DTCON_DT3_LENGTH                                   0x1
#define _DTCON_DT3_MASK                                     0x8
#define _DTCON_DT4_POSN                                     0x4
#define _DTCON_DT4_POSITION                                 0x4
#define _DTCON_DT4_SIZE                                     0x1
#define _DTCON_DT4_LENGTH                                   0x1
#define _DTCON_DT4_MASK                                     0x10
#define _DTCON_DT5_POSN                                     0x5
#define _DTCON_DT5_POSITION                                 0x5
#define _DTCON_DT5_SIZE                                     0x1
#define _DTCON_DT5_LENGTH                                   0x1
#define _DTCON_DT5_MASK                                     0x20
#define _DTCON_DTPS0_POSN                                   0x6
#define _DTCON_DTPS0_POSITION                               0x6
#define _DTCON_DTPS0_SIZE                                   0x1
#define _DTCON_DTPS0_LENGTH                                 0x1
#define _DTCON_DTPS0_MASK                                   0x40
#define _DTCON_DTPS1_POSN                                   0x7
#define _DTCON_DTPS1_POSITION                               0x7
#define _DTCON_DTPS1_SIZE                                   0x1
#define _DTCON_DTPS1_LENGTH                                 0x1
#define _DTCON_DTPS1_MASK                                   0x80

// Register: PWMCON1
#define PWMCON1 PWMCON1
extern volatile unsigned char           PWMCON1             __at(0xF85);
#ifndef _LIB_BUILD
asm("PWMCON1 equ 0F85h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned OSYNC                  :1;
        unsigned UDIS                   :1;
        unsigned                        :1;
        unsigned SEVTDIR                :1;
        unsigned SEVOPS                 :4;
    };
    struct {
        unsigned                        :4;
        unsigned SEVOPS0                :1;
        unsigned SEVOPS1                :1;
        unsigned SEVOPS2                :1;
        unsigned SEVOPS3                :1;
    };
} PWMCON1bits_t;
