MikroElektronika/core_packages/PIC/XC8/def/PIC18F1330/mcu.h
// Register: PTPERL
#define PTPERL PTPERL
extern volatile unsigned char           PTPERL              __at(0xF96);
#ifndef _LIB_BUILD
asm("PTPERL equ 0F96h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PTPERL                 :8;
    };
} PTPERLbits_t;
extern volatile PTPERLbits_t PTPERLbits __at(0xF96);
// bitfield macros
#define _PTPERL_PTPERL_POSN                                 0x0
#define _PTPERL_PTPERL_POSITION                             0x0
#define _PTPERL_PTPERL_SIZE                                 0x8
#define _PTPERL_PTPERL_LENGTH                               0x8
#define _PTPERL_PTPERL_MASK                                 0xFF

// Register: PTMRH
#define PTMRH PTMRH
extern volatile unsigned char           PTMRH               __at(0xF97);
#ifndef _LIB_BUILD
asm("PTMRH equ 0F97h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PTMRH                  :4;
    };
} PTMRHbits_t;
extern volatile PTMRHbits_t PTMRHbits __at(0xF97);
// bitfield macros
#define _PTMRH_PTMRH_POSN                                   0x0
#define _PTMRH_PTMRH_POSITION                               0x0
#define _PTMRH_PTMRH_SIZE                                   0x4
#define _PTMRH_PTMRH_LENGTH                                 0x4
#define _PTMRH_PTMRH_MASK                                   0xF

// Register: PTMRL
#define PTMRL PTMRL
extern volatile unsigned char           PTMRL               __at(0xF98);
#ifndef _LIB_BUILD
asm("PTMRL equ 0F98h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PTMRL                  :8;
    };
} PTMRLbits_t;
extern volatile PTMRLbits_t PTMRLbits __at(0xF98);
// bitfield macros
#define _PTMRL_PTMRL_POSN                                   0x0
#define _PTMRL_PTMRL_POSITION                               0x0
#define _PTMRL_PTMRL_SIZE                                   0x8
#define _PTMRL_PTMRL_LENGTH                                 0x8
#define _PTMRL_PTMRL_MASK                                   0xFF

// Register: PTCON1
#define PTCON1 PTCON1
extern volatile unsigned char           PTCON1              __at(0xF99);
#ifndef _LIB_BUILD
asm("PTCON1 equ 0F99h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :6;
        unsigned PTDIR                  :1;
        unsigned PTEN                   :1;
    };
} PTCON1bits_t;
extern volatile PTCON1bits_t PTCON1bits __at(0xF99);
// bitfield macros
#define _PTCON1_PTDIR_POSN                                  0x6
#define _PTCON1_PTDIR_POSITION                              0x6
#define _PTCON1_PTDIR_SIZE                                  0x1
#define _PTCON1_PTDIR_LENGTH                                0x1
#define _PTCON1_PTDIR_MASK                                  0x40
#define _PTCON1_PTEN_POSN                                   0x7
#define _PTCON1_PTEN_POSITION                               0x7
#define _PTCON1_PTEN_SIZE                                   0x1
#define _PTCON1_PTEN_LENGTH                                 0x1
#define _PTCON1_PTEN_MASK                                   0x80

// Register: PTCON0
#define PTCON0 PTCON0
extern volatile unsigned char           PTCON0              __at(0xF9A);
#ifndef _LIB_BUILD
asm("PTCON0 equ 0F9Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PTMOD                  :2;
        unsigned PTCKPS                 :2;
        unsigned PTOPS                  :4;
    };
    struct {
        unsigned PTMOD0                 :1;
        unsigned PTMOD1                 :1;
        unsigned PTCKPS0                :1;
        unsigned PTCKPS1                :1;
        unsigned PTOPS0                 :1;
        unsigned PTOPS1                 :1;
        unsigned PTOPS2                 :1;
        unsigned PTOPS3                 :1;
    };
} PTCON0bits_t;
extern volatile PTCON0bits_t PTCON0bits __at(0xF9A);
// bitfield macros
#define _PTCON0_PTMOD_POSN                                  0x0
#define _PTCON0_PTMOD_POSITION                              0x0
#define _PTCON0_PTMOD_SIZE                                  0x2
#define _PTCON0_PTMOD_LENGTH                                0x2
#define _PTCON0_PTMOD_MASK                                  0x3
#define _PTCON0_PTCKPS_POSN                                 0x2
#define _PTCON0_PTCKPS_POSITION                             0x2
#define _PTCON0_PTCKPS_SIZE                                 0x2
#define _PTCON0_PTCKPS_LENGTH                               0x2
#define _PTCON0_PTCKPS_MASK                                 0xC
#define _PTCON0_PTOPS_POSN                                  0x4
#define _PTCON0_PTOPS_POSITION                              0x4
#define _PTCON0_PTOPS_SIZE                                  0x4
#define _PTCON0_PTOPS_LENGTH                                0x4
#define _PTCON0_PTOPS_MASK                                  0xF0
#define _PTCON0_PTMOD0_POSN                                 0x0
#define _PTCON0_PTMOD0_POSITION                             0x0
#define _PTCON0_PTMOD0_SIZE                                 0x1
#define _PTCON0_PTMOD0_LENGTH                               0x1
#define _PTCON0_PTMOD0_MASK                                 0x1
#define _PTCON0_PTMOD1_POSN                                 0x1
#define _PTCON0_PTMOD1_POSITION                             0x1
#define _PTCON0_PTMOD1_SIZE                                 0x1
#define _PTCON0_PTMOD1_LENGTH                               0x1
#define _PTCON0_PTMOD1_MASK                                 0x2
#define _PTCON0_PTCKPS0_POSN                                0x2
#define _PTCON0_PTCKPS0_POSITION                            0x2
#define _PTCON0_PTCKPS0_SIZE                                0x1
#define _PTCON0_PTCKPS0_LENGTH                              0x1
#define _PTCON0_PTCKPS0_MASK                                0x4
#define _PTCON0_PTCKPS1_POSN                                0x3
#define _PTCON0_PTCKPS1_POSITION                            0x3
#define _PTCON0_PTCKPS1_SIZE                                0x1
#define _PTCON0_PTCKPS1_LENGTH                              0x1
#define _PTCON0_PTCKPS1_MASK                                0x8
#define _PTCON0_PTOPS0_POSN                                 0x4
#define _PTCON0_PTOPS0_POSITION                             0x4
#define _PTCON0_PTOPS0_SIZE                                 0x1
#define _PTCON0_PTOPS0_LENGTH                               0x1
#define _PTCON0_PTOPS0_MASK                                 0x10
#define _PTCON0_PTOPS1_POSN                                 0x5
#define _PTCON0_PTOPS1_POSITION                             0x5
#define _PTCON0_PTOPS1_SIZE                                 0x1
#define _PTCON0_PTOPS1_LENGTH                               0x1
#define _PTCON0_PTOPS1_MASK                                 0x20
#define _PTCON0_PTOPS2_POSN                                 0x6
#define _PTCON0_PTOPS2_POSITION                             0x6
#define _PTCON0_PTOPS2_SIZE                                 0x1
#define _PTCON0_PTOPS2_LENGTH                               0x1
#define _PTCON0_PTOPS2_MASK                                 0x40
#define _PTCON0_PTOPS3_POSN                                 0x7
#define _PTCON0_PTOPS3_POSITION                             0x7
#define _PTCON0_PTOPS3_SIZE                                 0x1
#define _PTCON0_PTOPS3_LENGTH                               0x1
#define _PTCON0_PTOPS3_MASK                                 0x80

